<!DOCTYPE html>

    
<html lang="{{ str_replace('_', '-', app()->getLocale()) }}">
    <head>
        <meta charset="utf-8">
        <title>Blog</title>
        <!-- Fonts -->
        <link rel="stylesheet" href="{{ asset('css/style.css') }}">
        
    </head>
    <body>
        <h1>流れ図学習ツール</h1>
        <h2 class='title'>
            <a href="/announces">お知らせ</a>
            <a href="/questions">問題を解く</a>
            
             
        </h2>
                <h2 class='title'>流れ図とは</h2>
                <p>流れ図とは、特定のプロセスやシステム内の手順やステップを視覚的に表現した図のことです。主にビジネスや工業、ソフトウェア開発などさま<br>
                ざまな分野で利用され、作業フロー、プロセスの流れ、タスクの実行手順などを明確に示すために使用されます。<br>

                流れ図は、基本的な形状や記号を使ってプロセスの各段階やステップを示し、それらの間の関係や流れを示します。典型的な流れ図には、開始点<br>
                と終了点、処理段階、決定ポイント、入力や出力、分岐やループなどの要素が含まれます。これらの要素は、図中で矢印や線で接続され、特定の<br>
                順序や方向性を示します。<br>

                流れ図を作成することで、複雑なプロセスやシステムを分かりやすく整理し、効率性を向上させることが可能です。従業員や関係者は、流れ図を<br>
                使用して作業手順やプロセスを理解しやすくなり、ミスや混乱を減らすことができます。さらに、流れ図は改善点や効率化の機会を見つけるため<br>
                の基盤としても活用されます。<br>

                流れ図は標準化された手法やツールを用いて作成されることがあり、代表的なものとしては、フローチャート、プロセスフロー図、ワークフロー<br>
                図などが挙げられます。これらの図を使用することで、チームや組織全体でのコミュニケーションや作業効率の向上に貢献することができます。</p>
                <p class='body'>このサイトを作った理由</p>
            <p>自分はjava学習の際scratchや流れ図などで大まかな処理手順を学ぶがそれららで得た知識をjava言語に関連付けしアウトプットをする際に上手く<br>
               出来ず、躓きjavaなどのプログラミング学習に苦手意識を持つ人がいる。その為、scratchや流れ図で得た知識の関連付けを補助する学習アプリを<br>
               作成することにした</p>
          
    </body>
</html>
